{ 
    "challenges" :[
        {
            "title": "Wiggle it out.",
            "text": "<p>Firstly, what are expressions in After Effects? Well, it's a way to use code snippets to affect some parameters of your animation. To activate those, you just need to press the alt key and click on the stopwatch of any parameter you'd like to use expressions for.</p><p>In After Effects, it's easy to get wiggly. You, yes you, can create random motion or jitter in a property with one simple expression.</p><p class=\"code-snippet\"> wiggle(frequency, amplitude)</p><p> See? Easy! Here is an example with a slight... shake.</p>",
            "illustration":"../assets/images/gifs/1.gif",
            "id": "1"
        },
        {
            "title": "Take some time.",
            "text": "",
            "id": "2"
        },
        {
            "title": "But can you do both?",
            "text": "Wiggling is fun, I must admit. But after a while, it's time to stop. How could you stop the motion using the time expression you just learned about?",
            "id": "3"
        },
        {
            "title": "Just loop around.",
            "text": "I think wee can all agree that loopings are the most fun you can have on a rollercoaster. It's also very fun to code by the way. Let's take a look and see how we could loop out an existing animation.",
            "id": "4"
        },
        {
            "title": "Anchor yourself.",
            "text": "An important notion to understand is how a composition works. You can easily access each and every layer, aspect, and parameter. thisComp, will help you target your current composition, while thisLayer will target the current layer you're working on. layer() alone can then target any specified layer. And after this, well, you can pretty much access any parameters, as you would unfolding the parameters of a layer as per usual.",
            "id": "5"
        },
        {
            "title": "Random.",
            "text": "Life can be a bit random. On the other hand, computers are usually not. But we can at least try to recreate a tad bit of randomness, which could be very interresting in some contexts.",
            "id": "6"
        },
        {
            "title": "Round and round in circles.",
            "text": "",
            "id": "7"
        },
        {
            "title": "Go with the flow.",
            "text": "Sometimes, expressions can seem a bit useless too. Their amazing capacities are able to simulate once again what can be achieve natively. So, how would you go about writing a simple mouvement oscillating from left to right, using a sinus function? Don't be fooled though, this can be extremely handy to build on and experiment with, to elevate animations to greater heights.",
            "id": "8"
        },
        {
            "title": "Delayed.",
            "text": "Creating a trail could create some nice new looks, and to do so you will need to use some delay. Let's dive into this.",
            "id": "9"
        },
        {
            "title": "Let's write it.",
            "text": "Expressions can be used to elevate some text layers too.",
            "id": "10"
        }
    ]
}